set number " Показывать номера строк
"colorscheme desert " Цветовая схема
syntax off " Подсвечивать синтаксис
set keymap=russian-jcukenwin " Переключаться на русский по команде Ctrl+^
set iminsert=0 " Латинская раскладка по умолчанию
set ic " Игнорировать регистр при поиске
set linebreak
set dy=lastline " Переносить по словам
" Копирование в CLIPBOARD
set laststatus=2 " Всегда показывать строку статуса
set statusline=%F%m%r%h%w\ %y\ enc:%{&enc}\ ff:%{&ff}\ col:%2c\ line:%2l/%L\ [%2p%%]
"set showtabline " Показывать строку вкладок всегда
set t_Co=256 " Использовать больше цветов
set exrc " Разрешить использование внешних конфигурационных файлов .vimrc
set nocompatible " Отключить совместимость с Vi
set showcmd " Отображать выполняемую команду
"filetype off " Отключить определение файла и утсановку опций в соответствии с типом этого файла
set secure " Запретить выполнение небезопасных команд в файле .vimrc проекта


" Горячие клавиши
vmap <C-c> "+y
vmap <C-p> "+p
imap [ []<LEFT>
imap ( ()<LEFT>
imap { {}<LEFT>
imap < <><LEFT>
inoremap " ""<LEFT>
inoremap ' ''<LEFT>
nmap <C-t> :tabnew<CR>
nmap <C-h> :tabp<CR>
nmap <C-l> :tabn<CR>


" Настройка отступов
" ==================

""tabstop (по умолчанию 8) — количество пробелов, которыми символ табуляции отображается в тексте. Оказывает влияние как на уже существующие табуляции, так и на новые. В случае изменения значения, «на лету» применяется к тексту.

""softtabstop (0) — количество пробелов, которыми символ табуляции отображается при добавлении. Несмотря на то, что при нажатии на Tab вы получите ожидаемый результат (добавляется новый символ табуляции), фактически в отступе могут использоваться как табуляция так и пробелы. Например, при установленных tabstop равной 8 и softtabstop равной 4, троекратное нажатие Tab приведет к добавлению отступа шириной 12 пробелов, однако сформирован он будет из одного символа табуляции и 4 пробелов.

""shiftwidth (8) — по умолчанию используется для регулирование ширины отступов в пробелах, добавляемых командами >> и <<. Если значение опции не равно tabstop, как и в случае с softtabstop, отступ может состоять как из символов табуляций так и из пробелов. При включении опции — smarttab, оказывает дополнительное влияние.

""smarttab (выключена) — в случае включения этой опции, нажатие Tab в начале строки (если быть точнее, до первого непробельного символа в строке) приведет к добавлению отступа, ширина которого соответствует shiftwidth (независимо от значений в tabstop и softtabstop). Нажатие на Backspace удалит отступ, а не только один символ, что очень полезно при включенной expandtab. Напомню: опция оказывает влияние только на отступы в начале строки, в остальных местах используются значения из tabstop и softtabstop.

""expandtab (выключена) — в режиме вставки заменяет символ табуляции на соответствующее количество пробелов. Так же влияет на отступы, добавляемые командами >> и <<

